package java_100_coding_0307;

public class java001_array02 {
	public static void main(String []args) {
		/*
		 * 
		 * 
		 * 문제
		 * 배열과 인덱스의 관계에 대해서 설명하고 배열의 초깃값은 어떻게 셋팅되는지 말해보시오.
		 크기 10의 정수형 배열을 생성하고 인덱스로 배열 공간의 값을 출력해보시오.
		 이 문제는 자바의 배열 및 인덱스 사용법 그리고 배열 생성시 초깃값이 어떻게 정해지는지를 묻는 문제이다.
		 아래 코드의 결과를 말해보시오?
		--------------------------------------------------------------------------
		// [1] : 배열 선언
		int[] scores = new int[10];
		// [2] : 선언한 배열 공간의 값을 인덱스로 출력하기
		System.out.println( scores[0] );
		System.out.println( scores[9] );
		System.out.println( sales_table[10] );
		 */
		
		//0
		//0
		//Error
		
		
		//[!] 배열과 인덱스 
		//배열 변수는 참조형 타입으로서 해당 메모리 공간을 가리킴
		// 즉 해당 메모리 공간의 주소 값을 가진다.   -> 이 주소 값을 통해서 잠조한다.
		// 주소 값은 다른 표현으로는 참조 값이라고도 부른다, 
		
	}
}
